# Воображаемые благодарности
# Образец применения escape-последовательностей
print("\t\t\tВоображаемые благодарности")
print("\t\t\t \\ \\ \\ \\ \\ \\ \\")
print("\t\t\tразработчика игры")
print("\t\t\tМайкла Доусона")
print("\t\t\t \\ \\ \\ \\ \\ \\ \\")
print("\nОтдельное спасибо хотелось бы сказать:")
print("""моему парикмахеру Генри по прозвищу \'Великолепный\', который не знает слова
\"невозможно\".""")
#звучит системный динамик
print("\a")
input("\n\nНажмите Enter, чтобы выйти.")
